app/Controllers/Pelanggan.php

    public function hapus($id_pelanggan){
        $this->model->delete($id_pelanggan);
---
DELETE FROM `pelanggan`
WHERE `id_pelanggan` IN ('32')

    public function edit($id_pelanggan)
    {
        $model = new \App\Models\ModelPelanggan();
        $data = $model->find($id_pelanggan);
---
SELECT *
FROM `pelanggan`
WHERE `pelanggan`.`id_pelanggan` = '8'

        ];

        if ($id_pelanggan && $this->model->find($id_pelanggan)) {
            $this->model->update($id_pelanggan, $data);
---
UPDATE `pelanggan` SET `nama` = 'aaaa ssu', `nomor_hp` = '456787663666', `alamat` = 'teryere', `jenis_orderan` = 'Take away'
WHERE `pelanggan`.`id_pelanggan` IN ('32')